Pruebas Minimas/Request WS/CargarFacturasToeBillGenericTAX.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:ebil="http://schemas.datacontract.org/2004/07/eBillCore" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:CargarFacturasToeBillGenericTAX>
         <!--Optional:-->
         <tem:FacCab>
            <!--Optional:-->
           <!--Optional:-->
            <ebil:AnoAprobacionRes>2020</ebil:AnoAprobacionRes>
            <!--Optional:-->
            <ebil:CREETotal>0</ebil:CREETotal>
            <!--Optional:-->
            <ebil:CiudadDANE>11001</ebil:CiudadDANE>
            <!--Optional:-->
            <ebil:CodVendedor>CodVen</ebil:CodVendedor>
            <!--Optional:-->
            <ebil:CorreoCliente>correoebill@gmail.com</ebil:CorreoCliente>
            <!--Optional:-->
            <ebil:DepartamentoDANE>11</ebil:DepartamentoDANE>
            <!--Optional:-->
            <ebil:Descuento>00000</ebil:Descuento>
            <!--Optional:-->
            <ebil:DigitoVerificaCliente>1</ebil:DigitoVerificaCliente>
            <!--Optional:-->
            <ebil:DireccionCliente>Calle 11a # 93 - 94</ebil:DireccionCliente>
            <!--Optional:-->
            <ebil:EstiloFactura>86</ebil:EstiloFactura>
            <!--Optional:-->
            <ebil:FechaExpedicion>2021-12-30</ebil:FechaExpedicion>
            <!--Optional:-->
            <ebil:FechaVencimiento>2021-12-30</ebil:FechaVencimiento>
            <!--Optional:-->
            <ebil:FormaPago>Forma_Pago_Dato</ebil:FormaPago>
            <!--Optional:-->
            <ebil:InfoAdicional>Nota Factura</ebil:InfoAdicional>
            <!--Optional:-->
            <ebil:MonedaISO>COP</ebil:MonedaISO>
            <!--Optional:-->
            <ebil:NitCliente>12345678</ebil:NitCliente>
            <!--Optional:-->
            <ebil:NitEmpresa>979762548</ebil:NitEmpresa>
            <!--Optional:-->
            <ebil:NombreCliente>CLIENTE DELL SQA-1126_ACT 2039</ebil:NombreCliente>
            <!--Optional:-->
            <ebil:NombreVendedor>Vendedor</ebil:NombreVendedor>
            <!--Optional:-->
            <ebil:NumAprobacionRes>1234567890</ebil:NumAprobacionRes>
            <!--Optional:-->
            <ebil:NumFactura>810</ebil:NumFactura>
            <!--Optional:-->
            <ebil:OrderID>810</ebil:OrderID>
            <!--Optional:-->
            <ebil:PAI_ISO_3166>44</ebil:PAI_ISO_3166>
            <!--Optional:-->
            <ebil:Prefijo>FAKF</ebil:Prefijo>
            <!--Optional:-->
            <ebil:RetencionCREETotal>0</ebil:RetencionCREETotal>
            <!--Optional:-->
            <ebil:SubTotal>10000</ebil:SubTotal>
            <!--Optional:-->
            <ebil:TIP_id_tipo_persona>1</ebil:TIP_id_tipo_persona>
            <!--Optional:-->
            <ebil:TelefonoCliente>2929289</ebil:TelefonoCliente>
            <!--Optional:-->
            <ebil:TipoComprobante>1</ebil:TipoComprobante>
            <!--Optional:-->
            <ebil:TipoContribuyente>2</ebil:TipoContribuyente>
            <!--Optional:-->
            <ebil:TipoIDCliente>5</ebil:TipoIDCliente>
            <!--Optional:-->
            <ebil:Total>	11900</ebil:Total>
            <!--Optional:-->
            <ebil:TotalIVA>1900</ebil:TotalIVA>
            <!--Optional:-->
            <ebil:TotalRetICA>0</ebil:TotalRetICA>
            <!--Optional:-->
            <ebil:TotalRetIVA>0</ebil:TotalRetIVA>
            <!--Optional:-->
            <ebil:TotalRetencion>0</ebil:TotalRetencion>
            <!--Optional:-->
            <ebil:Total_a_Pagar>11900</ebil:Total_a_Pagar>
            <!--Optional:-->
            <ebil:referencia>NumeroAvisoRecibo</ebil:referencia>
         </tem:FacCab>
         <!--Optional:-->
        <tem:DetFac>
            <!--Zero or more repetitions:-->
            <ebil:CFDDetConexion>
               <!--Optional:-->
               <ebil:Cantidad>3</ebil:Cantidad>
               <!--Optional:-->
               <ebil:CodigoProducto>1</ebil:CodigoProducto>
               <!--Optional:-->
               <ebil:Codigos>
                  <!--Zero or more repetitions:-->
                  <arr:string>2</arr:string>
               </ebil:Codigos>
               <!--Optional:-->
               <ebil:DescripcionConcepto>Hola hola</ebil:DescripcionConcepto>
               <!--Optional:-->
               <ebil:DescripcionProducto>Hola hola2</ebil:DescripcionProducto>
               <!--Optional:-->
               <ebil:DescuentoConcepto>0</ebil:DescuentoConcepto>
               <!--Optional:-->
               <ebil:IVAProducto>19</ebil:IVAProducto>
               <!--Optional:-->
               <ebil:NotasCon>0</ebil:NotasCon>
               <!--Optional:-->
               <ebil:PorIVAProducto>1546</ebil:PorIVAProducto>
               <!--Optional:-->
               <ebil:TotalConceptoSegMon>0</ebil:TotalConceptoSegMon>
               <!--Optional:-->
               <ebil:ValorUnitario>15464</ebil:ValorUnitario>
            </ebil:CFDDetConexion>
         </tem:DetFac>

         <!--Optional:-->
         <tem:Opciones>
             <!--Optional:-->
            <ebil:ActualizaProductos>true</ebil:ActualizaProductos>
            <!--Optional:-->
            <ebil:CalculaReteCree>false</ebil:CalculaReteCree>
            <!--Optional:-->
            <ebil:CalculaReteFuente>false</ebil:CalculaReteFuente>
            <!--Optional:-->
            <ebil:CalculaReteICA>false</ebil:CalculaReteICA>
            <!--Optional:-->
            <ebil:CalculaReteIVA>false</ebil:CalculaReteIVA>
            <!--Optional:-->
            <ebil:EmisionAutomatica>true</ebil:EmisionAutomatica>
            <!--Optional:-->
            <ebil:FacturasSinAcuerdo>true</ebil:FacturasSinAcuerdo>
            <!--Optional:-->
            <ebil:ModeloXAceptacion>true</ebil:ModeloXAceptacion>
            <!--Optional:-->
            <ebil:NotasRelacionadas>false</ebil:NotasRelacionadas>
            <!--Optional:-->
            <ebil:OrderControl>false</ebil:OrderControl>
            <!--Optional:-->
            <ebil:TieneAcuerdosFisicos>true</ebil:TieneAcuerdosFisicos>
            <!--Optional:-->
            <ebil:TokenConexion>259ee260-9354-453e-a5f3-69ee9dbba17d</ebil:TokenConexion>
            <!--Optional:-->
            <ebil:eBillAdmNumerosFactura>false</ebil:eBillAdmNumerosFactura>
         </tem:Opciones>
      </tem:CargarFacturasToeBillGenericTAX>
   </soapenv:Body>
</soapenv:Envelope>